# UnjoinOnEditWallChange Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..UnjoinOnEditWallChange Property
BuiltInFailures..::..WallFailures Class See Also
---
Line associated with a joined face has been moved. This action will cause the other walls to become disjoined from this face. [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnjoinOnEditWallChange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnjoinOnEditWallChange As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnjoinOnEditWallChange {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace